#include "patches.h"
#include "input.h"
#include "z64quake.h"
#include "play_patches.h"
#include "camera_patches.h"
#include "overlays/kaleido_scope/ovl_kaleido_scope/z_kaleido_scope.h"
#include "overlays/actors/ovl_Boss_04/z_boss_04.h"
#include "overlays/actors/ovl_En_Clear_Tag/z_en_clear_tag.h"
#include "z64shrink_window.h"
#include "z64player.h"

static bool prev_analog_cam_active = false;
static bool can_use_analog_cam = false;
static bool analog_cam_active = false;
static bool analog_cam_skip_once = false;

VecGeo analog_camera_pos = { .r = 66.0f, .pitch = 0, .yaw = 0 };

float analog_camera_yaw_vel = 0.0f;
float analog_camera_pitch_vel = 0.0f;

float analog_deadzone = 0.2f;
float analog_camera_x_sensitivity = 1500.0f;
float analog_camera_y_sensitivity = 500.0f;
// float analog_camera_acceleration = 500.0f;

static const float analog_cam_threshold = 0.1f;

void update_analog_camera_params(Camera* camera) {
    // recomp_printf("Camera at: %.2f %.2f %.2f\n"
    //               "      eye: %.2f %.2f %.2f\n"
    //               "      yaw: %d",
    //               camera->at.x, camera->at.y, camera->at.z,
    //               camera->eye.x, camera->eye.y, camera->eye.z,
    //               analog_camera_pos.yaw);
    // Check if the analog camera was usable in this frame.
    if (!can_use_analog_cam) {
        // It wasn't, so mark the analog cam as being off for this frame.
        analog_cam_active = false;
    }
    prev_analog_cam_active = analog_cam_active;
    if (!analog_cam_active) {
        // recomp_printf("Analog cam not active\n");
        analog_camera_pos.yaw = Math_Atan2S(camera->eye.x - camera->at.x, camera->eye.z - camera->at.z);
        analog_camera_pos.pitch = Math_Vec3f_Pitch(&camera->eye, &camera->at);
    }
}

void update_analog_cam(Camera* c) {
    can_use_analog_cam = true;
    
    Player* player = GET_PLAYER(c->play);
    // recomp_printf("  val: %d\n", func_80123434(player));
    
    // Check if the player just started Z targeting and reset to auto cam if so.
    static bool prev_targeting_held = false;
    bool targeting_held = func_80123434(player) || player->lockOnActor != NULL;
    if (targeting_held && !prev_targeting_held) {
        analog_cam_active = false;
    }
    
    // Enable analog cam if the right stick is held.
    float input_x, input_y;
    recomp_get_camera_inputs(&input_x, &input_y);

    if (fabsf(input_x) >= analog_cam_threshold || fabsf(input_y) >= analog_cam_threshold) {
        analog_cam_active = true;
    }
    
    if (analog_cam_skip_once) {
        analog_cam_active = false;
        analog_cam_skip_once = false;
    }
    
    // Record the Z targeting state.
    prev_targeting_held = targeting_held;

    if (analog_cam_active) {
        s32 inverted_x, inverted_y;
        recomp_get_analog_inverted_axes(&inverted_x, &inverted_y);

        if (inverted_x) {
            input_x = -input_x;
        }

        if (inverted_y) {
            input_y = -input_y;
        }

        analog_camera_yaw_vel = -input_x * analog_camera_x_sensitivity;
        analog_camera_pitch_vel = input_y * analog_camera_y_sensitivity;

        analog_camera_pos.pitch += analog_camera_pitch_vel;
        analog_camera_pos.yaw += analog_camera_yaw_vel;
        
        if (analog_camera_pos.pitch > 0x36B0) {
            analog_camera_pos.pitch = 0x36B0;
        }

        if (analog_camera_pos.pitch < -0x16D0) {
            analog_camera_pos.pitch = -0x16D0;
        }

        // recomp_printf("analog cam pitch: %05X\n", analog_camera_pos.pitch);
    }
}

extern s32 sUpdateCameraDirection;
extern s32 sCameraInterfaceFlags;

typedef struct {
    /* 0x0 */ s16 val;
    /* 0x2 */ s16 param;
} CameraModeValue; // size = 0x4

typedef struct {
    /* 0x0 */ s16 funcId;
    /* 0x2 */ s16 numValues;
    /* 0x4 */ CameraModeValue* values;
} CameraMode; // size = 0x8

typedef struct {
    /* 0x0 */ u32 validModes;
    /* 0x4 */ u32 flags;
    /* 0x8 */ CameraMode* cameraModes;
} CameraSetting;

extern CameraSetting sCameraSettings[];
s32 Camera_GetFocalActorPos(Vec3f* dst, Camera* camera);
f32 Camera_GetFocalActorHeight(Camera* camera);
f32 Camera_Vec3fMagnitude(Vec3f* vec);
f32 Camera_GetFloorY(Camera* camera, Vec3f* pos);
f32 Camera_GetFloorYNorm(Camera* camera, Vec3f* floorNorm, Vec3f* chkPos, s32* bgId);
s16 Camera_ScaledStepToFloorS(s16 target, s16 cur, f32 stepScale, s16 minDiff);
s32 func_800CBC84(Camera* camera, Vec3f* from, CameraCollision* to, s32 arg3);
void func_800CBFA4(Camera* camera, Vec3f* arg1, Vec3f* arg2, s32 arg3);
s32 Camera_CalcAtForParallel(Camera* camera, VecGeo* arg1, f32 yOffset, f32 xzOffsetMax, f32* focalActorPosY,
                             s16 flags);
Vec3s* Camera_GetBgCamOrActorCsCamFuncData(Camera* camera, u32 camDataId);
s32 Camera_IsClimbingLedge(Camera* camera);
void Camera_ScaledStepToCeilVec3f(Vec3f* target, Vec3f* cur, f32 xzStepScale, f32 yStepScale, f32 minDiff);
