#include "patches.h"
#include "input.h"
#include "z64quake.h"
#if 0
RecompCameraMode recomp_camera_mode = RECOMP_CAMERA_NORMAL;

VecGeo recomp_camera_pos = { .r = 66.0f, .pitch = 0, .yaw = 0 };

float recomp_camera_yaw_vel = 0.0f;
float recomp_camera_pitch_vel = 0.0f;


float recomp_deadzone = 0.2f;
float recomp_camera_x_sensitivity = 1500.0f;
float recomp_camera_y_sensitivity = 500.0f;
// float recomp_camera_acceleration = 500.0f;

void update_recomp_camera_params(Camera* camera) {
    recomp_camera_pos.yaw = Math_Atan2S(-camera->at.x + camera->eye.x, -camera->at.z + camera->eye.z);
    // recomp_printf("Camera at: %.2f %.2f %.2f\n"
    //               "      eye: %.2f %.2f %.2f\n"
    //               "      yaw: %d",
    //               camera->at.x, camera->at.y, camera->at.z,
    //               camera->eye.x, camera->eye.y, camera->eye.z,
    //               recomp_camera_pos.yaw);

    float input_x, input_y;
    recomp_get_camera_inputs(&input_x, &input_y);

    // Math_StepToF(&recomp_camera_yaw_vel, input_x * recomp_camera_x_sensitivity, recomp_camera_acceleration);
    // Math_StepToF(&recomp_camera_pitch_vel, input_y * recomp_camera_y_sensitivity, recomp_camera_acceleration);
    if (fabsf(input_x) > recomp_deadzone) {
        recomp_camera_yaw_vel = input_x * recomp_camera_x_sensitivity;
    }
    else {
        recomp_camera_yaw_vel = 0;
    }
    
    if (fabsf(input_y) > recomp_deadzone) {
        recomp_camera_pitch_vel = input_y * recomp_camera_y_sensitivity;
    }
    else {
        recomp_camera_pitch_vel = 0;
    }

    recomp_camera_pos.pitch += recomp_camera_pitch_vel;
    recomp_camera_pos.yaw += recomp_camera_yaw_vel;
}

extern s32 sUpdateCameraDirection;
static s32 sIsFalse = false;
extern s32 sCameraInitSceneTimer;

extern s16 sCameraNextUID;
extern s32 sCameraInterfaceFlags;
extern s32 sCameraHudVisibility;
extern s32 sCameraLetterboxSize;
extern s32 sCameraNegOne1;

#define CAM_DATA_IS_BG (1 << 12) // if not set, then cam data is for actor cutscenes

typedef s32 (*CameraUpdateFunc)(Camera*);

typedef struct {
    /* 0x0 */ s16 val;
    /* 0x2 */ s16 param;
} CameraModeValue; // size = 0x4

typedef struct {
    /* 0x0 */ s16 funcId;
    /* 0x2 */ s16 numValues;
    /* 0x4 */ CameraModeValue* values;
} CameraMode; // size = 0x8

typedef struct {
    /* 0x0 */ u32 validModes;
    /* 0x4 */ u32 flags;
    /* 0x8 */ CameraMode* cameraModes;
} CameraSetting;

extern CameraUpdateFunc sCameraUpdateHandlers[];
extern CameraSetting sCameraSettings[];

Vec3f Camera_CalcUpVec(s16 pitch, s16 yaw, s16 roll);
f32 Camera_fabsf(f32 f);
s32 Camera_GetBgCamIndex(Camera* camera, s32* bgId, CollisionPoly* poly);
f32 Camera_GetFocalActorHeight(Camera* camera);
f32 Camera_GetRunSpeedLimit(Camera* camera);
s32 Camera_IsDekuHovering(Camera* camera);
s32 Camera_IsMountedOnHorse(Camera* camera);
s32 Camera_IsUnderwaterAsZora(Camera* camera);
s32 Camera_IsUsingZoraFins(Camera* camera);
void Camera_UpdateInterface(s32 interfaceFlags);
f32 Camera_Vec3fMagnitude(Vec3f* vec);
s32 func_800CB7CC(Camera* camera);
s32 func_800CB854(Camera* camera);

Vec3s Camera_Update(Camera* camera) {
    Vec3f viewAt;
    Vec3f viewEye;
    Vec3f viewUp;
    Vec3f focalActorPos;
    s32 bgId;
    s32 sp98;
    s32 changeCamSceneDataType;
    CollisionPoly* sp90;
    CollisionPoly* sp8C;
    f32 runSpeedLimit;
    f32 speed;
